# Importdando e Concatenando

In [1]:
import pandas as pd

In [4]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [5]:
# Variável frame que irá atribuir uma lisca com duas liastas dos imports anteriores
frame = [nomes_f, nomes_m]

In [9]:
# Variável que irá concatenar a lista frame, transformar em uma data frame e retornar apenas os nomes
nomes = pd.concat(frame)['nome'].to_frame()

In [10]:
# Retorna 5 nomes aleatórios dentro do dataframe
nomes.sample(5)

         nome
133    BRENDA
65   MAURICIO
176      MARA
5       PAULO
129    AILTON

# Inserindo nova váriavel ID aleatória

In [11]:
import numpy as np
np.random.seed(123)

In [12]:
nomes['ID_Aluno'] = np.random.permutation(len(nomes)) + 1

In [13]:
nomes.sample(5)

          nome  ID_Aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

## Inserindo Variável E-mail

In [19]:
# Definindo o dominio do email
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, len(nomes))

In [15]:
nomes.sample(5)

          nome  ID_Aluno                 domínio
84    SEVERINO        78  @dominiodoemail.com.br
0         JOSE       331     @servicodoemail.com
179       IAGO       340  @dominiodoemail.com.br
10      SANDRA       174  @dominiodoemail.com.br
171  TERESINHA        45  @dominiodoemail.com.br

In [24]:
# Inserindo no Data Frame 'nomes' a concatenação dos dados da coluna nome com o domínio do e-mail
nomes['e-mail'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [22]:
nomes.drop(['domínio'], axis = 1)

,nome,ID_Aluno,e-mail,dominio
0,MARIA,235,maria@dominiodoemail.com.br,@dominiodoemail.com.br
1,ANA,43,ana@servicodoemail.com,@servicodoemail.com
2,FRANCISCA,304,francisca@dominiodoemail.com.br,@dominiodoemail.com.br
3,ANTONIA,156,antonia@servicodoemail.com,@servicodoemail.com
4,ADRIANA,343,adriana@dominiodoemail.com.br,@dominiodoemail.com.br
...,...,...,...,...
195,WALTER,231,walter@dominiodoemail.com.br,@dominiodoemail.com.br
196,ARLINDO,99,arlindo@dominiodoemail.com.br,@dominiodoemail.com.br
197,MICHAEL,323,michael@servicodoemail.com,@servicodoemail.com
198,ALVARO,383,alvaro@dominiodoemail.com.br,@dominiodoemail.com.br
199,GEOVANE,366,geovane@servicodoemail.com,@servicodoemail.com